app/controllers/sessions_controller.rb

INSERT INTO "guests" ("provider", "uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["provider", "twitter"], ["uid", "941850966"], ["created_at", "2016-07-11 21:01:31.993986"], ["updated_at", "2016-07-11 21:01:31.993986"]]
---
	def create
		@guest = Guest.find_or_create_from_auth_hash(auth_hash)