app/controllers/users_controller.rb

SELECT  "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "guests".* FROM "guests" WHERE "guests"."guest_name" = $1 LIMIT 1  [["guest_name", "*Anonymous*"]]
---
	def seek

    if current_guest
      @cur = Guest.find_by_id(session[:guest_id])
      logged_in = 1
    else
      #Exactly one of these should always exist
      @cur = ( Guest.where(:guest_name => '*Anonymous*').take(1) )[0]

INSERT INTO "users" ("name", "following", "phone", "carry", "deviceType") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "cachecreative"], ["following", "p4miles"], ["phone", "(865) 661-9434"], ["carry", "Verizon Wireless"], ["deviceType", "mobile"]]
---
        response = RestClient.get(reqUrl, reqPar)
      rescue
        if (validFound == 0)
          temp = User.create(:name => "*FLAG*", :following => ("*" + @uname + "*"), :phone => "*No match*", :carry => "*Vary search*", :deviceType => "*Thanks*", :guest_name => @cur.guest_name)

SELECT "users".* FROM "users"
---

      data = (JSON.parse(response))

      data["users"].each do |u|

SELECT "users".* FROM "users"
---
  def all
    @users = User.all

SELECT  "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."guest_name" = $1  [["guest_name", "Ben Knight"]]
---
  def local
    temp = Guest.find_by_id(session[:guest_id])
    @local_users = User.where(:guest_name => temp.guest_name)

SELECT  "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."guest_name" = $1  [["guest_name", "Ben Knight"]]
---
  def clear
    temp = Guest.find_by_id(session[:guest_id])
    User.where(:guest_name => temp.guest_name).destroy_all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 40]]
---
  def single
    @dude = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]
---
  def singleglobal
    @global_dude = User.find(params[:id])

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 40]]
---
  def killone
    User.destroy(params[:id])

SELECT "users".* FROM "users"
---
  def getstats
    @carriers = {}
    @types = {}
    all = User.all

SELECT  "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."guest_name" = $1  [["guest_name", "Ben Knight"]]
---
  def getlocalstats
    @local_carriers = {}
    @local_types = {}
    temp = Guest.find_by_id(session[:guest_id])
    all = User.where(:guest_name => temp.guest_name)